comprequirementrecap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-24 Tue 01:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="tranquocviet" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org48253f8">1. Submission related</a>
<ul>
<li><a href="#org7e5bcba">1.1. submission details</a></li>
<li><a href="#orgc7de67d">1.2. requirement for submission</a></li>
</ul>
</li>
<li><a href="#org64c66f5">2. Article Specification</a>
<ul>
<li><a href="#org072bff5">2.1. Coursework task recap</a></li>
<li><a href="#org2fc1e3f">2.2. Criteria</a></li>
<li><a href="#org5468ebd">2.3. Structure</a></li>
<li><a href="#org5f79d87">2.4. Notes</a>
<ul>
<li><a href="#org025f46d">2.4.1. Select specific topic</a></li>
<li><a href="#org13cf7e0">2.4.2. Larger topic board (select one of the following and find a specific use case for them)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org48253f8" class="outline-2">
<h2 id="org48253f8"><span class="section-number-2">1.</span> Submission related</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7e5bcba" class="outline-3">
<h3 id="org7e5bcba"><span class="section-number-3">1.1.</span> submission details</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>pdf containing report</li>
<li>screencast explaining the content from pdf and the method to gather content</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7de67d" class="outline-3">
<h3 id="orgc7de67d"><span class="section-number-3">1.2.</span> requirement for submission</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>screencast must contain audio voice over</li>
<li>research article must be written with Microsoft Word Online and must be shared with review access</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org64c66f5" class="outline-2">
<h2 id="org64c66f5"><span class="section-number-2">2.</span> Article Specification</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org072bff5" class="outline-3">
<h3 id="org072bff5"><span class="section-number-3">2.1.</span> Coursework task recap</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Select a data science related topic (most likely <b>any</b> topic)</li>
<li>Write an article on said topic</li>
</ul>
</div>
</div>
<div id="outline-container-org2fc1e3f" class="outline-3">
<h3 id="org2fc1e3f"><span class="section-number-3">2.2.</span> Criteria</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Has to be done independantly</li>
<li>Has to contain ~2000 words, excluding references</li>
<li>Topic has to be specific</li>
<li>Written in academic language and refer to the academic literature relevant</li>
<li>Reference should be written Havard-Style</li>
</ul>
</div>
</div>
<div id="outline-container-org5468ebd" class="outline-3">
<h3 id="org5468ebd"><span class="section-number-3">2.3.</span> Structure</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Title page</li>
<li>Introduction</li>
<li>Literature review</li>
<li>Discussion, arguments</li>
<li>(A set of) conclusions</li>
<li>(List of) references</li>
</ul>
</div>
</div>
<div id="outline-container-org5f79d87" class="outline-3">
<h3 id="org5f79d87"><span class="section-number-3">2.4.</span> Notes</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org025f46d" class="outline-4">
<h4 id="org025f46d"><span class="section-number-4">2.4.1.</span> Select specific topic</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>should only cover one use case for a larger Data science topic</li>
</ul>
</div>
</div>
<div id="outline-container-org13cf7e0" class="outline-4">
<h4 id="org13cf7e0"><span class="section-number-4">2.4.2.</span> Larger topic board (select one of the following and find a specific use case for them)</h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>Machine Learning</li>
<li>Artificial Intelligence</li>
<li>Data Mining</li>
<li>Big Data Analytics</li>
<li>Predictive Analytics</li>
<li>Natural Language Processing</li>
<li>Computer Vision</li>
<li>Image Processing</li>
<li>Time Series Analysis</li>
<li>Social Network Analysis</li>
<li>Recommender Systems</li>
<li>Data Visualisation</li>
<li>Sentiment Analysis</li>
<li>Web Scraping and Text Mining</li>
<li>Healthcare Data Analytics</li>
<li>Financial Data Analysis</li>
<li>Business Intelligence</li>
<li>Ethical and Legal Issues in Data Science</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tranquocviet</p>
<p class="date">Created: 2026-02-24 Tue 01:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
